`use strict`
const name = confirm(`Якщо \u2103 нажміть "ОK"`+'\n '+'Якщо \u2109 нажміть "Скасувати"');

 if ( name === true) {
     const t = Number(prompt('Введіть значення температури в' + '\u2103')); // Градус по Цельсію
     if (isNaN(t)) {
         alert('Напишіть число, будь ласка!');
     } else {
         alert(`в Фаренгейтах це буде ${((t + 40) * 1.8) - 40}` + `\u2109`); // Градус по Фаренгейту
     }
 }
     else if ( name === false) {
         const t = Number(prompt('Введіть значення температури в' + '\u2109')); // Фаренгейт
        if (isNaN(t)) {
         alert('Напишіть число, будь ласка!');
     } else {
         alert(`в градусах Цельсію це буде ${((t + 40) / 1.8) - 40}` + `\u2103`); // Градус по Цельсію
     }
 }