`use strict`;

// Task#1
// const x = 10;
// const y = 7;
// let z = x > y ? 'x більше за y' : `х не більше ніж y`;
// console.log (z);

// Task#2 Не було в переліку.

// Task#3

let a = +prompt(`Введіть ціле число`);

let b = (a.toString().length);
if (Number.isInteger(a)) {
    console.log(`Ви ввели ціле число ${a}, довжиною ${b} символів`)
} else {
    console.log(`Ви ввели число ${a}, довжиною ${b} символів, але це не те що вас попросили. `)

}



// Task#4

// let a = +prompt(`Введіть перше число`);
// let b = +prompt(`Введіть друге число`);
// let c = +prompt(`Введіть третє число`);
//
// if (a > b && b > c) {
//     console.log(` Число ${a} максимальне з введених ${a}, ${b} та ${c}.`);
// } else if (b > a && a > c){
//     console.log(` Число ${b} максимальне з введених ${a}, ${b} та ${c}.`);
// } else if (c > b && b > a){
//     console.log(` Число ${c} максимальне з введених ${a}, ${b} та ${c}.`);
// } else {
//     console.log(` щось не так з вашими числами  ${a}, ${b} та ${c}.`);
// }


// Task#5

// let a = +prompt(`Введіть довжину сторони 'а' трикутника `);
// let b = +prompt(`Введіть довжину сторони 'а' трикутника `);
// let c = +prompt(`Введіть довжину сторони 'а' трикутника `);
//
// if ( a + b > c && a + c > b && b + c > a) {
//     console.log (`Трикутник зі сторонами ${a}, ${b} та ${c} - існує`)
// } else {
//     console.log (`Трикутника зі сторонами ${a}, ${b} та ${c} - не може існувати`)
// }

